applications/rhoFixedFlowFoam/tests/verification/graetzWedge/0/p
FoamFile {version 2.0; format ascii; class volScalarField; object p;}
dimensions    [1 -1 -2 0 0 0 0];
internalField uniform @P@;
boundaryField {
  "(INLET|OUTLET|WALL)" {type calculated; value uniform @P@;}
  "(FRONT|BACK)"        {type wedge;}
  AXIS                  {type empty;}
}
