applications/rhoFixedFlowFoam/tests/verification/graetzWedge/0/Y_PbI2_g
FoamFile {version 2.0; format ascii; class volScalarField; object Y_PbI2_g;}
dimensions    [0 0 0 0 0 0 0];
internalField uniform 0;
boundaryField {
  INLET          {type fixedValue; value uniform 1;}
  OUTLET         {@OUTLETBC@}
  WALL           {type zeroGradient;}
  "(FRONT|BACK)" {type wedge;}
  AXIS           {type empty;}
}
