applications/rhoFixedFlowFoam/tests/verification/graetzWedge/system/fvSolution
/*------------------------------------------------------------------------------

system/fvSolution of tests/verification/graetzWedge

  One tight solver dictionary (relTol 0), so every corrector is final.
  @SOLVERNOTE@

------------------------------------------------------------------------------*/
FoamFile {version 2.0; format ascii; class dictionary; object fvSolution;}

solvers {
  Y_PbI2_g {
    @SOLVER@
  }
  Y_PbI2_s {solver diagonal;}
}
